#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.ubunturoutervm.data.template_file.cloudconfig_linux: Reading...
module.ubunturoutervm.data.template_file.cloudconfig_linux: Read complete after 0s [id=a4ff24c39f7a2feee804e4ea94abfe4a922a8b0a4fecb2248a35dbea72d09f9b]
module.ubunturoutervm.random_id.randomid_pip: Refreshing state... [id=Uh6p-Q]
module.ubunturoutervm.random_id.randomIdVM: Refreshing state... [id=vW97NjAQUkg]
module.ubunturoutervm.data.template_cloudinit_config.config_linux: Reading...
module.ubunturoutervm.data.template_cloudinit_config.config_linux: Read complete after 0s [id=4183974395]
azurerm_resource_group.rg_hub: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001]
azurerm_resource_group.rg_compute: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001]
module.spoke1network.azurerm_resource_group.rg-spoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001]
module.spoke2network.azurerm_resource_group.rg-spoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001]
azurerm_network_security_group.nsg-router: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkSecurityGroups/nsg-router]
azurerm_virtual_network.vnet_hub: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet_hub-001]
module.spoke2network.azurerm_route_table.spoke-rt-table: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/routeTables/rt-vnet-spoke2-001]
module.spoke2network.azurerm_virtual_network.vnet-spoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001]
module.spoke1network.azurerm_route_table.spoke-rt-table: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/routeTables/rt-vnet-spoke1-001]
module.spoke1network.azurerm_virtual_network.vnet-spoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001]
module.ubunturoutervm.random_id.randomId: Refreshing state... [id=omXZZonWaRs]
module.ubunturoutervm.azurerm_public_ip.pip_spokevmnic: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Network/publicIPAddresses/pip-vm-hub-dev-001]
module.ubunturoutervm.azurerm_storage_account.spokestorageaccount: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Storage/storageAccounts/diaga265d96689d6691b]
azurerm_subnet.subnet_hub[0]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet_hub-001/subnets/RouterSubnet]
module.spoke2network.azurerm_virtual_network_peering.hubspoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet_hub-001/virtualNetworkPeerings/hub-vnet-spoke2-001]
module.spoke2network.azurerm_virtual_network_peering.spokehub: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/virtualNetworkPeerings/vnet-spoke2-001-hub]
module.spoke2network.azurerm_subnet.subnet-spoke[2]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/DatabaseTier]
module.spoke2network.azurerm_subnet.subnet-spoke[0]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/WebTier]
module.spoke2network.azurerm_subnet.subnet-spoke[1]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/LogicTier]
module.spoke1network.azurerm_virtual_network_peering.spokehub: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/virtualNetworkPeerings/vnet-spoke1-001-hub]
module.spoke1network.azurerm_subnet.subnet-spoke[0]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/WebTier]
module.spoke1network.azurerm_subnet.subnet-spoke[1]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/LogicTier]
module.spoke1network.azurerm_subnet.subnet-spoke[2]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/DatabaseTier]
module.spoke1network.azurerm_virtual_network_peering.hubspoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet_hub-001/virtualNetworkPeerings/hub-vnet-spoke1-001]
azurerm_subnet_network_security_group_association.nsg-router-association: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet_hub-001/subnets/RouterSubnet]
module.ubunturoutervm.azurerm_network_interface.spokevmnic: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Network/networkInterfaces/nic-vm-hub-dev-001-521ea9f9]
module.spoke2network.azurerm_subnet_route_table_association.route_table_association[2]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/DatabaseTier]
module.spoke2network.azurerm_subnet_route_table_association.route_table_association[1]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/LogicTier]
module.spoke2network.azurerm_subnet_route_table_association.route_table_association[0]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/WebTier]
module.spoke1network.azurerm_route.default-route: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/routeTables/rt-vnet-spoke1-001/routes/default-route-entry]
module.spoke2network.azurerm_route.default-route: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/routeTables/rt-vnet-spoke2-001/routes/default-route-entry]
module.spoke1network.azurerm_subnet_route_table_association.route_table_association[0]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/WebTier]
module.spoke1network.azurerm_subnet_route_table_association.route_table_association[1]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/LogicTier]
module.spoke1network.azurerm_subnet_route_table_association.route_table_association[2]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/DatabaseTier]
module.ubunturoutervm.azurerm_virtual_machine.spokevm: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-hub-dev-001]
module.ubuntuspoke1.data.template_file.cloudconfig_linux: Reading...
module.ubuntuspoke2.data.template_file.cloudconfig_linux: Reading...
module.ubuntuspoke1.random_id.randomIdVM: Refreshing state... [id=a97oFGlc7CQ]
module.ubuntuspoke1.data.template_file.cloudconfig_linux: Read complete after 0s [id=d13e49c8fd9541d78852e0ab770d293f4b2131cdadf6da9db57074c8291c1f41]
module.ubuntuspoke2.data.template_file.cloudconfig_linux: Read complete after 0s [id=d13e49c8fd9541d78852e0ab770d293f4b2131cdadf6da9db57074c8291c1f41]
module.ubuntuspoke2.random_id.randomId: Refreshing state... [id=u_wYGKY03ik]
module.ubuntuspoke1.random_id.randomId: Refreshing state... [id=L1GudeXZRfw]
module.ubuntuspoke2.random_id.randomIdVM: Refreshing state... [id=l6pBV1QmfWA]
module.ubuntuspoke1.data.template_cloudinit_config.config_linux: Reading...
module.ubuntuspoke2.data.template_cloudinit_config.config_linux: Reading...
module.ubuntuspoke2.data.template_cloudinit_config.config_linux: Read complete after 0s [id=2389926595]
module.ubuntuspoke1.data.template_cloudinit_config.config_linux: Read complete after 0s [id=2389926595]
module.ubuntuspoke2.azurerm_network_interface.spokevmnic: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Network/networkInterfaces/nic-vm-spoke2-dev-001-97aa415754267d60]
module.ubuntuspoke2.azurerm_storage_account.spokestorageaccount: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Storage/storageAccounts/diagbbfc1818a634de29]
module.ubuntuspoke1.azurerm_network_interface.spokevmnic: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Network/networkInterfaces/nic-vm-spoke1-dev-001-6bdee814695cec24]
module.ubuntuspoke1.azurerm_storage_account.spokestorageaccount: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Storage/storageAccounts/diag2f51ae75e5d945fc]
module.ubuntuspoke1.azurerm_virtual_machine.spokevm: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke1-dev-001]
module.ubuntuspoke2.azurerm_virtual_machine.spokevm: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke2-dev-001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_log_analytics_workspace.law_platform will be created
  + resource "azurerm_log_analytics_workspace" "law_platform" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "swedencentral"
      + name                            = "law-platform"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "rg-net-hub-001"
      + retention_in_days               = (known after apply)
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "applicationname" = "SpokeVendingMachine"
          + "environment"     = "Dev"
          + "supportgroup"    = "Markus Kraus"
        }
      + workspace_id                    = (known after apply)
    }

  # azurerm_network_connection_monitor.ubunturoutervm_monitor_ubuntucom will be created
  + resource "azurerm_network_connection_monitor" "ubunturoutervm_monitor_ubuntucom" {
      + id                            = (known after apply)
      + location                      = "swedencentral"
      + name                          = "vm-hub-dev-001-ubuntucom"
      + network_watcher_id            = (known after apply)
      + notes                         = "ubunturoutervm-ubuntucom"
      + output_workspace_resource_ids = (known after apply)
      + tags                          = {
          + "applicationname" = "SpokeVendingMachine"
          + "environment"     = "Dev"
          + "supportgroup"    = "Markus Kraus"
        }

      + endpoint {
          + excluded_ip_addresses = []
          + included_ip_addresses = []
          + name                  = "source"
          + target_resource_id    = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-hub-dev-001"
            # (3 unchanged attributes hidden)

          + filter {
              + type = "Include"

              + item {
                  + address = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-hub-dev-001"
                  + type    = "AgentAddress"
                }
            }
        }
      + endpoint {
          + address               = "archive.ubuntu.com"
          + excluded_ip_addresses = []
          + included_ip_addresses = []
          + name                  = "destination"
          + target_resource_id    = (known after apply)
            # (2 unchanged attributes hidden)
        }

      + test_configuration {
          + name                      = "tcpName"
          + protocol                  = "Tcp"
          + test_frequency_in_seconds = 60
            # (1 unchanged attribute hidden)

          + tcp_configuration {
              + port                      = 80
              + trace_route_enabled       = true
                # (1 unchanged attribute hidden)
            }
        }

      + test_group {
          + destination_endpoints    = [
              + "destination",
            ]
          + enabled                  = true
          + name                     = "ubunturoutervm"
          + source_endpoints         = [
              + "source",
            ]
          + test_configuration_names = [
              + "tcpName",
            ]
        }
    }

  # azurerm_network_watcher.networkwatcher_hub will be created
  + resource "azurerm_network_watcher" "networkwatcher_hub" {
      + id                  = (known after apply)
      + location            = "swedencentral"
      + name                = "network-watcher-hub"
      + resource_group_name = "rg-net-hub-001"
      + tags                = {
          + "applicationname" = "SpokeVendingMachine"
          + "environment"     = "Dev"
          + "supportgroup"    = "Markus Kraus"
        }
    }

  # azurerm_virtual_machine_extension.ubunturoutervm_networkwatcher will be created
  + resource "azurerm_virtual_machine_extension" "ubunturoutervm_networkwatcher" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "vm-hub-dev-001-networkwatcher"
      + publisher                   = "Microsoft.Azure.NetworkWatcher"
      + tags                        = {
          + "applicationname" = "SpokeVendingMachine"
          + "environment"     = "Dev"
          + "supportgroup"    = "Markus Kraus"
        }
      + type                        = "NetworkWatcherAgentLinux"
      + type_handler_version        = "1.4"
      + virtual_machine_id          = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-hub-dev-001"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @vMarkusK, Action: `pull_request`, Working Directory: ``, Workflow: `Validate and Plan on PR`*